<template>
  <v-list flat three-line shaped width="40%" style="margin-left: 25%;background-color: aliceblue">
    <v-list-item-group color="blue">
      <v-list-item to="/" style="margin-bottom: 3px;background-color: white;height: auto" v-for="(item, i) in items" :key="i">
        <BlogListItem :blog="item"></BlogListItem>
      </v-list-item>
    </v-list-item-group>
  </v-list>
</template>

<script>
import BlogListItem from "@/components/BlogListItem";

export default {
  name: "UserHome",
  data: function () {
    return {
      items: [
        {
          id: 3,
          title: "美妙的文章",
          content: "美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章",
          created_at: "1601013349",
          user_id: 0
        },
        {
          id: 4,
          title: "稀烂的文章",
          content: "就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？",
          created_at: "1601025016",
          user_id: 0
        },
        {
          id: 4,
          title: "稀烂的文章",
          content: "就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？",
          created_at: "1601025016",
          user_id: 0
        },
        {
          id: 4,
          title: "稀烂的文章",
          content: "就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？",
          created_at: "1601025016",
          user_id: 0
        },
        {
          id: 4,
          title: "稀烂的文章",
          content: "就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？",
          created_at: "1601025016",
          user_id: 0
        },
        {
          id: 4,
          title: "稀烂的文章",
          content: "就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？",
          created_at: "1601025016",
          user_id: 0
        }
      ]
    };
  },

  components: {
    BlogListItem
  }
};
</script>

<style scoped></style>
