<template>
  <v-list style="margin: 0 auto" flat three-line :width="maxWidth > maxHeight ?
      0.4*maxWidth +'px'
       : 0.9*maxWidth  + 'px'">
    <v-list-item-group color="blue">
      <v-list-item to="/" v-for="(item, i) in items"
                   :key="i"
                   style="display: -webkit-box;-webkit-box-orient: vertical;">
        <BlogListItem
            :blog="item"
            :width="width"
            :maxWidth="maxWidth"
            :maxHeight="maxHeight"
        >
        </BlogListItem>
        <v-divider
            class="mx-0"
            v-if="i!==items.length-1"
        ></v-divider>
      </v-list-item>
    </v-list-item-group>
  </v-list>
</template>

<script>
import BlogListItem from "@/components/BlogListItem";

export default {
  name: "UserHome",
  data: function () {
    return {
      items: [
        {
          id: 3,
          title: "美妙的文章",
          content: "美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章美妙的文章",
          created_at: "1601013349",
          user_id: 0
        },
        {
          id: 4,
          title: "稀烂的文章",
          content: "就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？",
          created_at: "1601025016",
          user_id: 0
        },
        {
          id: 4,
          title: "稀烂的文章",
          content: "就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？",
          created_at: "1601025016",
          user_id: 0
        },
        {
          id: 4,
          title: "稀烂的文章",
          content: "就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？",
          created_at: "1601025016",
          user_id: 0
        },
        {
          id: 4,
          title: "稀烂的文章",
          content: "就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？",
          created_at: "1601025016",
          user_id: 0
        },
        {
          id: 4,
          title: "稀烂的文章",
          content: "就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？就这？鸡又这？",
          created_at: "1601025016",
          user_id: 0
        }
      ]
    };
  },
  props: ['width', 'maxWidth', 'maxHeight'],
  components: {
    BlogListItem
  }
};
</script>

<style scoped>

</style>
